Autodesk.Revit.DB.DirectShape.SetDirectContextTransform(Autodesk.Revit.DB.Transform)
Sets the transform representing the transformation needed to transform the orginal
DirectContext3D in this DirectShape from its original position and orientation to its
current position and orientation.
trf:
The transform.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.DirectShape.AddParam(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ParameterValue)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.DirectShape.IsValidReferencePlaneBoundingBoxUV(Autodesk.Revit.DB.BoundingBoxUV)
Validates that the input BoundingBoxUV is suitable for bounding a reference plane surface.
The input BoundingBoxUV must be set and not degenerate.
boundingBoxUV:
The reference plane BoundingBoxUV to test.
Returns:
True if the input BoundingBoxUV is valid for reference plane surfaces, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.DirectShape.IsValidReferenceCurve(Autodesk.Revit.DB.Curve)
Validates that the input curve is suitable for creating a direct shape reference curve.
Bounded and unbounded lines are accepted.
Other bounded and unbounded curve types with natural bounds are accepted if they are not closed.
Unbounded periodic curves are not allowed.
curve:
The curve to test.
Returns:
True if the input curve point can be used to create a direct shape reference curve, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015